Repository: sajeerali-creo/WP-THEME-HELP
Catalog: PLUGINS/easy-replace-image/langs/eri-*.po
Languages: ro_ro

source: Easy Replace Image
ro_ro: Înlocuire ușoară imagine

source: This plugin allows you to replace an attachment file by uploading another image or by downloading one from a specified URL, without deleting the attachment. The plugin handles the image sizes generation and the attachment metadata update, and you will see the result right away.
ro_ro: Acest modul vă permite să înlocuiți fișierul unui atașament prin încărcarea unei alte imagini sau prin decărcarea uneia de la un URL specificat, fără a șterge atașamentul. Modulul rezolvă și generarea mărimilor de imagine și actualizează metadata atașamentului, și veți putea vedea rezultatul imediat.

source: You must specify an image URL.
ro_ro: Trebuie să specificați un URL.

source: The image could not be fetched.
ro_ro: Imaginea nu s-a putut descărca.

source: You must select an image file.
ro_ro: Trebuie să selectați un fișier de tip imagine.

source: The image could not be uploaded.
ro_ro: Imaginea nu s-a putut încărca.

source: Select a file.
ro_ro: Selectați un fișier.

source: Attachment Search
ro_ro: Căutare atașament

source: Search
ro_ro: Caută

source: Search here for a specific image that you want to replace. The search will match the attachment ID, title, guid or image metadata.
ro_ro: Căutați aici imaginea specifică pe care doriți să o înlocuiți. Căutarea se potrivește pentru ID-ul atașamentului, titlul, URL fișier sau metadatele imaginii.

source: Search results
ro_ro: Rezultatele căutării

source: Showing %1$d items out of %2$d
ro_ro: Se afișează %1$d elemente din %2$d

source: Click the item from the list below to select it for replacement.
ro_ro: Apăsați elementul din lista de mai jos pentru a-l selecta pentru înlocuire.

source: Click to select the image
ro_ro: Apăsați pentru a selecta imaginea

source: No image found.
ro_ro: Nu s-a găsit nicio imagine.

source: No search key applied.
ro_ro: Nu s-a aplicat nicio cheie de căutare.

source: No attachment selected.
ro_ro: Nu s-a selectat niciun atașament.

source: Selected Image
ro_ro: Imagine selectată

source: Click to go to the attachment page
ro_ro: Apăsați pentru a merge la pagina atașamentului

source: Upload
ro_ro: Încarcă

source: Get from URL
ro_ro: Descarcă de la URL

source: Replace* the attachment file with the image from the specified URL
ro_ro: Înlocuiește* fișierul atașamentului cu imaginea de la URL-ul specificat

source: Image URL
ro_ro: URL imagine

source: Download
ro_ro: Descarcă

source: * If the image you specify can be downloaded to your site uploads folder, it will replace the current file.
ro_ro: * Dacă imaginea pe care o specificați se poate descărca în directorul uploads al sitului dumneavoastră, aceasta va înlocui fișierul curent.

source: Replace* the attachment file with the image you upload
ro_ro: Înlocuiește* fișierul atașamentului cu imaginea pe care o încarci

source: * If the image you specify can be uploaded to your site uploads folder, it will replace the current file.
ro_ro: * Dacă imaginea se poate încărca în directorul uploads al sitului dumneavoastră, aceasta va înlocui fișierul curent.

source: Easy replace any image
ro_ro: Înlocuire ușoară oricare imagine

source: Settings
ro_ro: Setări

source: Plugin URL
ro_ro: URL modul

source: A huge thanks in advance!
ro_ro: Multe mulțumiri în avans!

source: If you find the plugin useful and would like to support my work, please consider making a <a href="%1$s" target="_blank">donation</a>. <br>It would make me very happy if you would leave a %2$s rating. %3$s
ro_ro: Dacă acest modul îți este folositor și ai dori să îmi sprijini munca, m-aș bucura dacă ai face o <a href="%1$s" target="_blank">donație</a>. <br>M-ar bucura mult dacă ai lăsa o recenzie de %2$s. %3$s

source: %5$sCheck out my other <a href="%1$s" target="_blank" rel="noreferrer">%2$s free plugins</a> on WordPress.org and the <a href="%3$s" target="_blank" rel="noreferrer">%4$s other extensions</a> available!
ro_ro: %5$sVezi și celelalte <a href="%1$s" target="_blank" rel="noreferrer">%2$s module gratuite</a> ale mele pe WordPress.org și <a href="%3$s" target="_blank" rel="noreferrer">%4$s extensiile premium</a> disponibile!

source: %1$s plugin was activated!
ro_ro: Modulul %1$s a fost activat!
